Revit 2027 API
BuiltInFailures.WallFailures.ParameterChangeNotAffectingGeometry Property
 Changing this element's parameter has no effect on its current position or geometry. Check to see if the element is constrained either in the project view or in the element's sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ParameterChangeNotAffectingGeometry { get; }
Public Shared ReadOnly Property ParameterChangeNotAffectingGeometry As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ParameterChangeNotAffectingGeometry {
	FailureDefinitionId^ get ();
}
static member ParameterChangeNotAffectingGeometry : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace